# Напишите программу, которая принимает на вход вещественное число и 
# показывает сумму его цифр.
# Пример:
# - 6782 -> 23
# - 0,56 -> 11

A = float(input("Введите число: "))
if A < 0: A = A * (-1)
sum1 = 0
sum2 = 0
a1 = A // 1
a2 = round(A % 1, 10)
while a1 > 0:
    b = a1 % 10
    sum1 += b 
    a1 //= 10
while a2 > 0 and a2 < 1:
    c = a2 * 10 // 1
    sum2 += c
    a2 = round(a2 * 10 % 1, 10)

print(f'{sum1 + sum2}')
